aoc2018.org
:setup:
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: post
#+todo: todo | edit finished
#+PROPERTY: header-args :exports code :results output
:end:
#+title:  Advent of Code 2018
#+author: Piotr Kaznowski
#+date:   2020-01-03

* edit Day 05: Alchemical Reduction :peek:pop:remove:queue:
CLOSED: [2020-01-22 Wed 11:31]
:PROPERTIES:
:EXPORT_FILE_NAME: day05
:EXPORT_HUGO_WEIGHT: 105
 :EXPORT_HUGO_CUSTOM_FRONT_MATTER+: :summary "Peek and pop: building a simple queue"
:END:
** Puzzle summary
https://adventofcode.com/2018/day/5

As input we get string of 50.000 chars which is referred to as a "polymer". Polymer consists of units which correspond to letters. Units are of the same type when referring to the same letter of alphabet but differ by "polarity" when their case is different. Polymer reacts in the way that neighbor units of the same type and opposite polarity consume each other, namely string like ~Aa~ or ~bB~ would disappear. Our task is to find the lenght of the polymer after all reactions take place.

For example string ~dabAcCaCBAcCcaDA~ produces 10-char long polymer ~dabCBAcaDA~.

** Descriptions :noexport:
*** Part 1
You've managed to sneak in to the prototype suit manufacturing lab. The Elves are making decent progress, but are still struggling with the suit's size reduction capabilities.

While the very latest in 1518 alchemical technology might have solved their problem eventually, you can do better. You scan the chemical composition of the suit's material and discover that it is formed by extremely long polymers (one of which is available as your puzzle input).

The polymer is formed by smaller units which, when triggered, react with each other such that two adjacent units of the same type and opposite polarity are destroyed. Units' types are represented by letters; units' polarity is represented by capitalization. For instance, r and R are units with the same type but opposite polarity, whereas r and s are entirely different types and do not react.

For example:

In aA, a and A react, leaving nothing behind.
In abBA, bB destroys itself, leaving aA. As above, this then destroys itself, leaving nothing.
In abAB, no two adjacent units are of the same type, and so nothing happens.
In aabAAB, even though aa and AA are of the same type, their polarities match, and so nothing happens.
Now, consider a larger example, dabAcCaCBAcCcaDA:

dabAcCaCBAcCcaDA  The first 'cC' is removed.
dabAaCBAcCcaDA    This creates 'Aa', which is removed.
dabCBAcCcaDA      Either 'cC' or 'Cc' are removed (the result is the same).
dabCBAcaDA        No further actions can be taken.
After all possible reactions, the resulting polymer contains 10 units.

How many units remain after fully reacting the polymer you scanned? (Note: in this puzzle and others, the input is large; if you copy/paste your input, make sure you get the whole thing.)

*** Part 2
Time to improve the polymer.

One of the unit types is causing problems; it's preventing the polymer from collapsing as much as it should. Your goal is to figure out which unit type is causing the most problems, remove all instances of it (regardless of polarity), fully react the remaining polymer, and measure its length.

For example, again using the polymer dabAcCaCBAcCcaDA from above:

Removing all A/a units produces dbcCCBcCcD. Fully reacting this polymer produces dbCBcD, which has length 6.
Removing all B/b units produces daAcCaCAcCcaDA. Fully reacting this polymer produces daCAcaDA, which has length 8.
Removing all C/c units produces dabAaBAaDA. Fully reacting this polymer produces daDA, which has length 4.
Removing all D/d units produces abAcCaCBAcCcaA. Fully reacting this polymer produces abCBAc, which has length 6.
In this example, removing all C/c units was best, producing the answer 4.

What is the length of the shortest polymer you can produce by removing all units of exactly one type and fully reacting the result?

** Solution
[[https://gitlab.com/pkaznowski/aoc18/blob/master/src/aoc18/puzzle05.clj][Check full solution in the repo]]

*** Namespace :noexport:
#+name: day05_ns
#+begin_src clojure :noweb-ref code05 :results silent :exports none
  (ns aoc18.puzzle05 (:require [aoc18.utils :refer [input->str]]
                               [clojure.repl :refer [doc]]))

#+end_src

#+name: test05_ns
#+begin_src clojure :noweb-ref test05 :results silent :exports none
  (ns aoc18.puzzle05-test
    (:require [aoc18.puzzle05 :refer :all]
              [clojure.test :refer :all]))

#+end_src

*** Helper: find matching letters
Since reaction consists of "consuming" units of the same type but opposite polarity which means the same letters of opposite case we could use ~Character/isUpperCase~ to build a simple function ~upper?~ and look for two chars which reduced to the same case (by ~clojure.string/lower-case~ for example) are equal but differ cases. But this is somewhat tedious. Much simpler solution will be to convert chars to integers because this reduces whole logic to one calculation: checking if absolute difference between two ints is 32 (this being the difference between lowercase and uppercase letters represented by ints). 

#+name: day04_chars_to_ints
#+begin_src clojure :exports code :results output :results value
  (map char (range 97 123))
  ;; => (\a \b \c \d \e \f \g \h \i \j \k \l \m \n \o \p \q \r \s \t \u \v \w \x \y \z)
  (map char (map #(- % 32) (range 97 123)))
  ;; => (\A \B \C \D \E \F \G \H \I \J \K \L \M \N \O \P \Q \R \S \T \U \V \W \X \Y \Z)
#+end_src

This should return ~nil~ or throw an exception:

#+name: day05_assert
#+begin_src clojure :exports code :results code 
  (assert (= (- (int \a) (int \A)) 32))   ;; => nil

#+end_src

Good. So our helper func would look like this:

#+name: day05_match
#+begin_src clojure :noweb-ref code05 
(defn match? [a b] (= (java.lang.Math/abs (- a b)) 32))

#+end_src

Let's test it:

#+name: day05_match_test
#+begin_src clojure :noweb-ref test05
  (deftest match-test
    (testing "the same letters compared should return true, otherwise false"
      (is (= true  (reduce match? (map int [\A \a]))))
      (is (= true  (reduce match? (map int [\b \B]))))
      (is (= false (reduce match? (map int [\c \D]))))
      (is (= false (reduce match? (map int [\f \g]))))
      (is (= false (reduce match? (map int [\H \I]))))))

#+end_src

*** React and count (1)
This kind of task looks like perfectly suited for functional approach. At the beginning I thought I would be very easy: we need to ~reduce~ original collection of chars to filtered one, where condition is our ~match?~ func. The logic: if last unit from new collection is matching current unit taken from the original one, return new collection without the last unit (using ~butlast~ func); if not, add current unit to the new collection -- produced polymer. But behavior wasn't as I'd expect, since Clojure, as it seems, implements different behaviors to different collections. 

For example, look at ~conj~ docs:
#+name: day05_doc_conj
#+begin_src clojure :exports results
(doc conj)
#+end_src

#+RESULTS: day05_doc_conj
: -------------------------
: clojure.core/conj
: ([coll x] [coll x & xs])
:   conj[oin]. Returns a new collection with the xs
:     'added'. (conj nil item) returns (item).  The 'addition' may
:     happen at different 'places' depending on the concrete type.

Let's emphasize this:

#+begin_example
The 'addition' may happen at different 'places' depending on the concrete type. 
#+end_example

Only converting collections to ~vectors~ ensured expected output, but it was slooooow. Then I found some commentary which explained that one of the reasons to implement different behavior for different collections may be ability to build FIFOs or queues and, in fact, this is what I was looking for (I thought that ~last~, ~butlast~ and ~conj~ would do the job). To implement this I had to pick differntly crafted func: ~peek~ and ~pop~. 

Let's look at [[https://clojuredocs.org/clojure.core/peek][peek]] docs:

#+name: day05_doc_peek
#+begin_src clojure :exports results
(doc peek)
#+end_src

#+RESULTS: day05_doc_peek
: -------------------------
: clojure.core/peek
: ([coll])
:   For a list or queue, same as first, for a vector, same as, but much
:   more efficient than, last. If the collection is empty, returns nil.

And [[https://clojuredocs.org/clojure.core/pop][pop]]:

#+name: day05_doc_pop
#+begin_src clojure :exports results
(doc pop)
#+end_src

#+RESULTS: day05_doc_pop
: -------------------------
: clojure.core/pop
: ([coll])
:   For a list or queue, returns a new list/queue without the first
:   item, for a vector, returns a new vector without the last item. If
:   the collection is empty, throws an exception.  Note - not the same
:   as next/butlast.

I had to experiment with that a little to find out how exactly my code would behave, and than came out to this simple solution:

#+name: day05_react
#+begin_src clojure :noweb-ref code05
(defn react [polymer]
  (count
   (reduce
    (fn [coll unit]
      (if (and (seq coll) (match? (peek coll) unit))
        (pop coll)
        (conj coll unit)))
    '() polymer)))

#+end_src

*** Find the shortest polymer (2)
Our task is to find reaction which produces the shortest polymer /after/ removing units of the same type (namely letters which differ only casewise). Since I've converted input string to integers now I have only to exclude pairs of integers where one is in the range from 97 to 122 and second is minus 32.  

#+name: day05_remove_units
#+begin_src clojure :noweb-ref code05 
(defn remove-units [coll unit] (remove (hash-set unit (- unit 32)) coll))

#+end_src

~remove~ takes a predicate agains a collection. At first I wrote an explicit predicate which was combining arithmetical operations:

#+begin_example clojure
  #(or (= num %) (= (- num 32) %))
#+end_example

But since [[http://clojure-doc.org/articles/language/functions.html#sets-as-functions][sets may be functions]] we can use a ~hash-set~ as a predicate, as above.

Testing. ~remove-units~ operate on integers but let's use string and chars for readability sake:
 
#+name: day05_remove_units_test
#+begin_src clojure :noweb-ref test05
  (deftest remove-units-test
    (testing "should remove ints corresponding to lower- and uppercase letters from the
              collection"
      (is (= [\o \l \a \n]
             (vec (map char (remove-units (map int "Golang") (int \g))))))
      (is (= [\C \l \o \j \u \r \e]
             (vec (map char (remove-units (map int "Clojure") (int \x))))))))

#+end_src

*** Putting things together
Solution to the second part consists of finding the shortest polymer after consecutively removing some units. I'd map ~react~ feed by polymer with removed units over range of available units (i.e. chars):

#+name: day05_solution
#+begin_src clojure :noweb-ref code05
  (defn solve [input]
    (let [polymer (map int input)]
      {:part1 (time (react polymer))
       :part2 (time (apply min
                           (map #(react (remove-units polymer %))
                                (range 97 123))))
       }))

#+end_src

#+name: day05_remove_units_test
#+begin_src clojure :noweb-ref test05
  (deftest solve-test
    (testing "should match examples"
      (is (= {:part1 10 :part2 4} (solve "dabAcCaCBAcCcaDA")))))

#+end_src

#+name: day05_tangle
#+begin_src clojure :noweb yes :tangle src/aoc18/puzzle05.clj :exports none :results silent
  <<code05>>
#+end_src

#+name: day05_test_tangle
#+begin_src clojure :noweb yes :tangle test/aoc18/puzzle05_test.clj :exports none :results silent
  <<test05>>
#+end_src

Run all tests:

#+name: day05_tests
#+begin_src clojure :results output :exports results
  (require '[clojure.test :refer [run-tests]] 'aoc18.puzzle05-test)
  (run-tests 'aoc18.puzzle05-test)
#+end_src

#+RESULTS: day05_tests
: 
: Testing aoc18.puzzle05-test
: "Elapsed time: 0.191675 msecs"
: "Elapsed time: 3.69894 msecs"
: 
: Ran 3 tests containing 8 assertions.
: 0 failures, 0 errors.

Get the answer:

#+name: day05_results
#+begin_src clojure :ns aoc18.puzzle05 :exports none :results code
  (solve (first (input->str "day05")))
#+end_src

#+RESULTS: 
#+begin_src clojure 
  "Elapsed time: 416.582294 msecs"
  "Elapsed time: 10419.124998 msecs"
  {:part1 10972, :part2 5278}
#+end_src

It takes about 10 sec to complete the second part (without using queue it was taking too long) -- I'm curious how could I optimize it to work faster?

** COMMENT Commentary


